# Homebrew
# https://brew.sh/
# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f

tap "encoredev/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "tursodatabase/tap"
tap "vectordotdev/brew"

brew "deno"
brew "fnm"
brew "gh"
brew "git"
brew "git-lfs"
brew "pnpm"
brew "podman"
brew "spaceship"
brew "stow"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "encoredev/tap/encore"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "oven-sh/bun/bun"
brew "tursodatabase/tap/turso"
brew "vectordotdev/brew/vector"
cask "aerospace"
cask "font-fira-code"
cask "ghostty"
cask "hashicorp-vagrant"
cask "nomad"
cask "orbstack"
cask "warp"
cask "wkhtmltopdf"
